In [1]:
import numpy as np
import pandas as pd
import time
from datetime import datetime, date
import json
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('python hands-on - dataset.csv')
df.head()

         date        sku warehouse_location  quantity
0  2021-01-02  100940478              lagos        23
1  2020-11-09  100940479              lagos        84
2  2021-01-15  100940480                oyo        11
3  2016-11-09  100940481               ogun        98
4  2017-04-04  100940482               ogun        23

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date                10 non-null     object
 1   sku                 10 non-null     int64
 2   warehouse_location  10 non-null     object
 3   quantity            10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 448.0+ bytes

In [4]:
df.describe()

                sku    quantity
count  1.000000e+01   10.000000
mean   1.009405e+08   46.100000
std    3.027650e+00   63.546046
min    1.009405e+08    3.000000
25%    1.009405e+08    7.500000
50%    1.009405e+08   17.000000
75%    1.009405e+08   68.750000
max    1.009405e+08  199.000000

In [5]:
df['date'].unique()

array(['2021-01-02', '2020-11-09', '2021-01-15', '2016-11-09',
       '2017-04-04', '2018-01-13', '2021-03-15', '2021-01-11',
       '2021-02-16', '2019-06-06'], dtype=object)

In [6]:
df.isnull().sum()

date                  0
sku                   0
warehouse_location    0
quantity              0
dtype: int64

In [7]:
df['date']=pd.to_datetime(df['date'])

df.head()

        date        sku warehouse_location  quantity
0 2021-01-02  100940478              lagos        23
1 2020-11-09  100940479              lagos        84
2 2021-01-15  100940480                oyo        11
3 2016-11-09  100940481               ogun        98
4 2017-04-04  100940482               ogun        23

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date                10 non-null     datetime64[ns]
 1   sku                 10 non-null     int64
 2   warehouse_location  10 non-null     object
 3   quantity            10 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 448.0+ bytes

In [9]:
ddate = '2021-01-01'
ddate=pd.to_datetime(ddate)
def expired(date):
    
    if date <=  ddate:
        return True
    else:
        return False

In [10]:
df['obsolete'] = df['date'].apply(expired)

In [11]:
df

        date        sku warehouse_location  quantity  obsolete
0 2021-01-02  100940478              lagos        23     False
1 2020-11-09  100940479              lagos        84      True
2 2021-01-15  100940480                oyo        11     False
3 2016-11-09  100940481               ogun        98      True
4 2017-04-04  100940482               ogun        23      True
5 2018-01-13  100940483               abia         3      True
6 2021-03-15  100940484             kaduna         7     False
7 2021-01-11  100940485              abuja         4     False
8 2021-02-16  100940486               kano         9     False
9 2019-06-06  100940487            anambra       199      True

In [12]:
result = df.to_json()
parsed = json.loads(result)

In [13]:
parsed

{'date': {'0': 1609545600000,
  '1': 1604880000000,
  '2': 1610668800000,
  '3': 1478649600000,
  '4': 1491264000000,
  '5': 1515801600000,
  '6': 1615766400000,
  '7': 1610323200000,
  '8': 1613433600000,
  '9': 1559779200000},
 'sku': {'0': 100940478,
  '1': 100940479,
  '2': 100940480,
  '3': 100940481,
  '4': 100940482,
  '5': 100940483,
  '6': 100940484,
  '7': 100940485,
  '8': 100940486,
  '9': 100940487},
 'warehouse_location': {'0': 'lagos',
  '1': 'lagos',
  '2': 'oyo',
  '3': 'ogun',
  '4': 'ogun',
  '5': 'abia',
  '6': 'kaduna',
  '7': 'abuja',
  '8': 'kano',
  '9': 'anambra'},
 'quantity': {'0': 23,
  '1': 84,
  '2': 11,
  '3': 98,
  '4': 23,
  '5': 3,
  '6': 7,
  '7': 4,
  '8': 9,
  '9': 199},
 'obsolete': {'0': False,
  '1': True,
  '2': False,
  '3': True,
  '4': True,
  '5': True,
  '6': False,
  '7': False,
  '8': False,
  '9': True}}

In [14]:
json_file = df.to_json('Data2bots.json')

In [15]:
df2 = pd.read_json('Data2bots.json')

In [16]:
df2

        date        sku warehouse_location  quantity  obsolete
0 2021-01-02  100940478              lagos        23     False
1 2020-11-09  100940479              lagos        84      True
2 2021-01-15  100940480                oyo        11     False
3 2016-11-09  100940481               ogun        98      True
4 2017-04-04  100940482               ogun        23      True
5 2018-01-13  100940483               abia         3      True
6 2021-03-15  100940484             kaduna         7     False
7 2021-01-11  100940485              abuja         4     False
8 2021-02-16  100940486               kano         9     False
9 2019-06-06  100940487            anambra       199      True